#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-074b1768acf554503][0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-0798482ad0444440a][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-00ed92986f2772a1d][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-0ed2efdebd255bf14][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1522206696][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-2372193134][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-3017359774][0m
[0m[1mdata.aws_subnets.app: Read complete after 0s [id=ca-central-1][0m
[0m[1mdata.aws_subnets.data: Read complete after 0s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-6-subnet-group][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-0cf6d1d0881003055][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-QREQBO7OJ2BNPMGOR3SKSRPEVQ][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # aws_efs_access_point.ga_ap_root[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_efs_access_point" "ga_ap_root" {
        id              = "fsap-0cf6d1d0881003055"
      [33m~[0m[0m tags            = {
          [33m~[0m[0m "Name" = (sensitive value)
        }
      [33m~[0m[0m tags_all        = {
          [33m~[0m[0m "Name" = "GA-root-issue-6-ap" [33m->[0m[0m "root-issue-6"
        }
        [90m# (4 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_efs_file_system.ga_efs[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_efs_file_system" "ga_efs" {
        id                              = "fs-0798482ad0444440a"
        name                            = "GA-issue-6-efs"
        tags                            = {
            "Name" = (sensitive value)
        }
      [33m~[0m[0m throughput_mode                 = "bursting" [33m->[0m[0m "elastic"
        [90m# (13 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_efs_mount_target.ga_efs_mount_target_1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "ga_efs_mount_target_1" {
      [32m+[0m[0m availability_zone_id   = (known after apply)
      [32m+[0m[0m availability_zone_name = (known after apply)
      [32m+[0m[0m dns_name               = (known after apply)
      [32m+[0m[0m file_system_arn        = (known after apply)
      [32m+[0m[0m file_system_id         = "fs-0798482ad0444440a"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip_address             = (known after apply)
      [32m+[0m[0m mount_target_dns_name  = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m security_groups        = [
          [32m+[0m[0m "sg-074b1768acf554503",
        ]
      [32m+[0m[0m subnet_id              = "subnet-012542a6eb687c5f0"
    }

[1m  # aws_efs_mount_target.ga_efs_mount_target_2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "ga_efs_mount_target_2" {
      [32m+[0m[0m availability_zone_id   = (known after apply)
      [32m+[0m[0m availability_zone_name = (known after apply)
      [32m+[0m[0m dns_name               = (known after apply)
      [32m+[0m[0m file_system_arn        = (known after apply)
      [32m+[0m[0m file_system_id         = "fs-0798482ad0444440a"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip_address             = (known after apply)
      [32m+[0m[0m mount_target_dns_name  = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m security_groups        = [
          [32m+[0m[0m "sg-074b1768acf554503",
        ]
      [32m+[0m[0m subnet_id              = "subnet-0e7eb644778bb567f"
    }

[1mPlan:[0m 2 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*